In [1]:
import pandas as pd

df = pd.read_csv('data/LTOTALNSA.csv', index_col='DATE', parse_dates=True)

In [2]:
df.head()

            LTOTALNSA
DATE
1976-01-01      864.6
1976-02-01      973.3
1976-03-01     1216.1
1976-04-01     1163.2
1976-05-01     1176.1

## Resampling
Simply put, resampling allows you to change the aggregation level of a time series. If you have data collected in hourly intervals but need daily totals for the analysis, resampling is the way to go.

In [6]:
yearly_total = df.resample(rule = 'Y').sum()
yearly_total.head()

            LTOTALNSA
DATE
1976-12-31    12969.8
1977-12-31    14481.9
1978-12-31    14981.0
1979-12-31    13758.4
1980-12-31    11197.5

## Shifting
将某一列的数据全部向下或者向上移位

In [7]:
df_shift = df.copy()
df_shift['Shift_1'] = df_shift['LTOTALNSA'].shift(1)
df_shift['Shift_2'] = df_shift['LTOTALNSA'].shift(2)
df_shift.head()

            LTOTALNSA  Shift_1  Shift_2
DATE
1976-01-01      864.6      NaN      NaN
1976-02-01      973.3    864.6      NaN
1976-03-01     1216.1    973.3    864.6
1976-04-01     1163.2   1216.1    973.3
1976-05-01     1176.1   1163.2   1216.1

## Rolling
可以按照季度/年度统计

In [9]:
df_rolling = df.copy()
df_rolling['QuaterRolling'] = df_rolling['LTOTALNSA'].rolling(window=3).mean()
df_rolling['YearRolling'] = df_rolling['LTOTALNSA'].rolling(window=12).mean()
df_rolling.head()

            LTOTALNSA  QuaterRolling  YearRolling
DATE
1976-01-01      864.6            NaN          NaN
1976-02-01      973.3            NaN          NaN
1976-03-01     1216.1    1018.000000          NaN
1976-04-01     1163.2    1117.533333          NaN
1976-05-01     1176.1    1185.133333          NaN

## Deferencing
financial data<br>
计算差值

In [10]:
df_diff = df.copy()
df_diff['Diff_1'] = df_diff['LTOTALNSA'].diff(periods=1)
df_diff['Diff_2'] = df_diff['LTOTALNSA'].diff(periods=2)
df_diff.head()

# First order:   973.3 - 864.6 = 108.7
# Second order: 1216.1 - 864.6 = 351.5

            LTOTALNSA  Diff_1  Diff_2
DATE
1976-01-01      864.6     NaN     NaN
1976-02-01      973.3   108.7     NaN
1976-03-01     1216.1   242.8   351.5
1976-04-01     1163.2   -52.9   189.9
1976-05-01     1176.1    12.9   -40.0